#Область ПрограммныйИнтерфейс
Процедура ДополнитьФорму(Форма) Экспорт
	// ++Орлов Задача Добавление реквизита формы "Контактное лицо" 27.10.2024	
	ИмяФормы = Форма.Имяформы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
	ИначеЕсли 
		ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли 
		ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли 
		ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли 
		ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	// --Орлов Задача Добавление реквизита формы "Контактное лицо" 27.10.2024	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) 
	// ++Орлов Задача Добавление реквизита формы "Контактное лицо" 07.01.2025	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Дор_КонтактноеЛицо";
	// --Орлов Задача Добавление реквизита формы "Контактное лицо" 07.01.2025	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	// ++Орлов Задача Добавление реквизита формы "Контактное лицо" 07.01.2025	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Дор_КонтактноеЛицо";
	// --Орлов Задача Добавление реквизита формы "Контактное лицо" 07.01.2025	
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма)
	// ++Орлов Задача Добавление реквизита формы "Согласованная скидка" 07.01.2025 	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Дор_СогласованнаяСкидка";
	// --Орлов Задача Добавление реквизита формы "Согласованная скидка" 07.01.2025
КонецПроцедуры
#КонецОбласти